app/Controllers/Admin_controller.php

    public function actualizarUsuario($id)
    {
        $model = new usuario_model();
        $data = [
            'nombre_ape' => $this->request->getVar('nombre_ape'),
            'telefono' => $this->request->getVar('telefono'),
            'email' => $this->request->getVar('email'),
            'nacimiento' => $this->request->getVar('nacimiento'),
            'perfil_id' => $this->request->getVar('perfil_id'),
            'baja' => $this->request->getVar('baja')
        ];
        $model->update($id, $data);
---
UPDATE `usuarios` SET `nombre_ape` = 'usuario2', `telefono` = '3333', `email` = 'usuario@gmail.com', `nacimiento` = '1900-10-10', `perfil_id` = '2', `baja` = 'NO'
WHERE `usuarios`.`id_usuario` IN ('15')

    public function bajaUsuario($id)
    {
        $model = new usuario_model();
        $model->update($id, ['baja' => 'SI']);
---
UPDATE `usuarios` SET `baja` = 'SI'
WHERE `usuarios`.`id_usuario` IN ('12')